# How to read a tabular  data file in Pandas?

In [1]:
import pandas as pd

In [13]:
#File with Headers and tab seperated
orders = pd.read_table('http://bit.ly/chiporders')

In [14]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [15]:
user_cols = ['user_id','age','gender','occupation','zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep = '|', names = user_cols, header = None)

In [16]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

# How to select a pandas Series from a Dataframe?

In [42]:
# The only differnce between read_csv and read_table is the default serpators.  read_csv default seperator is ','
ufo = pd.read_csv('http://bit.ly/uforeports')

In [43]:
print type(ufo)
ufo.head()

<class 'pandas.core.frame.DataFrame'>

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [44]:
cities = ufo.City # pandas Serieis
# or cities =  ufo['City']
# ufo['Colors Reported']

In [45]:
ufo['location'] = ufo.City +', '+ ufo.State
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [28]:
# Tip : Click inside a method's parentheses and hit Shift+Tab 1,2,3, or 4 times to see more information about the method.

# How to rename a columns in a Dataframe?

In [29]:
ufo.columns

Index([u'City', u'Colors Reported', u'Shape Reported', u'State', u'Time',
       u'location'],
      dtype='object')

In [30]:
ufo.rename(columns = {'Colors Reported':'Colors_reported','Shape Reported':'Shape_Reported'}, inplace=True)

In [32]:
ufo.columns

Index([u'City', u'Colors_reported', u'Shape_Reported', u'State', u'Time',
       u'location'],
      dtype='object')

In [39]:
ufo_cols = ['city', 'colors reported', 'shape reported', 'state', 'time', 'location']
ufo.columns = ufo_cols

In [40]:
ufo.head()

,city,colors reported,shape reported,state,time,location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [46]:
# To overwrite column names while reading the file
col_names = ['city', 'colors reported', 'shape reported', 'state', 'time']
ufo = pd.read_csv('http://bit.ly/uforeports', names = col_names, header = 0)

In [48]:
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [52]:
# Replace all the spaces in the column names with underscore
ufo.columns = ufo.columns.str.replace(' ','_')

In [53]:
ufo.columns

Index([u'city', u'colors_reported', u'shape_reported', u'state', u'time'], dtype='object')

# How to remove columns from pandas Datafrane?

In [54]:
ufo.columns

Index([u'city', u'colors_reported', u'shape_reported', u'state', u'time'], dtype='object')

In [55]:
ufo.drop(['colors_reported', 'time'], axis = 1, inplace=True)

In [56]:
ufo.columns

Index([u'city', u'shape_reported', u'state'], dtype='object')

In [57]:
ufo.shape

(18241, 3)

In [58]:
#To delete rows from a Dataframe use axis = 0 (default)
ufo.drop([0,1],inplace=True)

In [59]:
ufo.head()

                   city shape_reported state
2               Holyoke           OVAL    CO
3               Abilene           DISK    KS
4  New York Worlds Fair          LIGHT    NY
5           Valley City           DISK    ND
6           Crater Lake         CIRCLE    CA

In [60]:
ufo.shape

(18239, 3)

# How to sort a pandas Series and Dataframe

In [62]:
movies = pd.read_csv("http://bit.ly/imdbratings")

In [63]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [71]:
movies['title'].sort_values().head() #ascending = False can be used as parameter

542     (500) Days of Summer
5               12 Angry Men
201         12 Years a Slave
698                127 Hours
110    2001: A Space Odyssey
Name: title, dtype: object

In [72]:
#Sort the entire dataframe based on a column
movies.sort_values('title').head()

,star_rating,title,content_rating,genre,duration,actors_list
542,7.8,(500) Days of Summer,PG-13,Comedy,95,"[u'Zooey Deschanel', u'Joseph Gordon-Levitt', ..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
201,8.1,12 Years a Slave,R,Biography,134,"[u'Chiwetel Ejiofor', u'Michael Kenneth Willia..."
698,7.6,127 Hours,R,Adventure,94,"[u'James Franco', u'Amber Tamblyn', u'Kate Mara']"
110,8.3,2001: A Space Odyssey,G,Mystery,160,"[u'Keir Dullea', u'Gary Lockwood', u'William S..."

In [73]:
#Sort the entire dataframe based on multipls columns
movies.sort_values(['content_rating','duration']).head()

,star_rating,title,content_rating,genre,duration,actors_list
713,7.6,The Jungle Book,APPROVED,Animation,78,"[u'Phil Harris', u'Sebastian Cabot', u'Louis P..."
513,7.8,Invasion of the Body Snatchers,APPROVED,Horror,80,"[u'Kevin McCarthy', u'Dana Wynter', u'Larry Ga..."
272,8.1,The Killing,APPROVED,Crime,85,"[u'Sterling Hayden', u'Coleen Gray', u'Vince E..."
703,7.6,Dracula,APPROVED,Horror,85,"[u'Bela Lugosi', u'Helen Chandler', u'David Ma..."
612,7.7,A Hard Day's Night,APPROVED,Comedy,87,"[u'John Lennon', u'Paul McCartney', u'George H..."